--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 626001, gadget_id = 70310001, pos = { x = 1990.360, y = 237.014, z = 808.508 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 18, state = GadgetState.GearStart },
	{ config_id = 626002, gadget_id = 70310001, pos = { x = 1993.450, y = 237.171, z = 810.758 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 18, state = GadgetState.GearStart },
	{ config_id = 626003, gadget_id = 70310001, pos = { x = 1993.771, y = 237.241, z = 801.392 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 18, state = GadgetState.GearStart },
	{ config_id = 626004, gadget_id = 70310001, pos = { x = 1999.221, y = 237.140, z = 805.253 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 18, state = GadgetState.GearStart },
	{ config_id = 626005, gadget_id = 70310001, pos = { x = 2005.885, y = 237.140, z = 801.785 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 18, state = GadgetState.GearStart },
	{ config_id = 626006, gadget_id = 70310001, pos = { x = 1996.105, y = 237.140, z = 795.168 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 18, state = GadgetState.GearStart }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 626001, 626002, 626003, 626004, 626005, 626006 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
