-- 所有的group
groups = {
	{ id = 250023001, refresh_id = 1, pos = { x = 1.185, y = 0.080, z = 8.083 } },
	{ id = 250023002, refresh_id = 1, pos = { x = -0.092, y = 0.080, z = -9.868 } },
	{ id = 250023003, refresh_id = 1001, pos = { x = 5.439, y = 0.080, z = 0.887 } },
	{ id = 250023004, refresh_id = 1, pos = { x = -1.938, y = 0.071, z = -0.872 } },
	{ id = 250023005, refresh_id = 1, pos = { x = -0.252, y = 0.115, z = -0.695 } },
	{ id = 250023006, refresh_id = 1, pos = { x = 0.206, y = 0.114, z = -1.156 } },
	{ id = 250023007, refresh_id = 1, pos = { x = 0.116, y = 0.028, z = 0.156 } }
}